views/security/user_type_list.php

SELECT * FROM `user_type`
---
								</tr>
							</thead>
							<tbody>
								<?php $i=1; foreach ( UserType::find()->with('role0')->asArray()->all() as $key => $value) { ?>

SELECT * FROM `user_type`
---
		<th>Role Name</th>
		<th>Action</th>
	</tr>
<?php $i=1; foreach ( UserType::find()->with('role0')->asArray()->all() as $key => $value) { ?>