controllers/SecurityController.php

SELECT * FROM `role` WHERE `id`='8'
UPDATE `role` SET `name`='manager hrd bro' WHERE `id`=8
DELETE FROM `role_module` WHERE role = 8
---
	public function actionUpdateRole(){
		if($this->isUpdateAllowed()){
			if(Yii::$app->request->post()){
				$role = Role::findOne(Yii::$app->request->get()['id']);
				$role->name = Yii::$app->request->post()['role'];
				$role->update();

				$rowsDeleted = RoleModule::deleteAll('role = '.Yii::$app->request->get()['id']);