controllers/SiteController.php

    public function actionLogin()
    {
        $session = Yii::$app->session;
        $session->open();

        if(!$session['session.user']['login']){
            $model = new LoginForm();
            $postData = Yii::$app->request->post();
            if ($model->load($postData) && $model->login()) {
                $userData = VUserRole::find()->where(["id_user"=>Yii::$app->user->getId()])->asArray()->all();
---
SELECT * FROM `v_user_role` WHERE `id_user`=11