views/site/portal.php


use yii\helpers\Html;

$module = Module::find()->asArray()->all();
---
SELECT * FROM `module`