models/Role.php

    public function updateRole($id, $data){
        foreach ($data['module'] as $key => $value) {
            foreach ($value['role'] as $key2 => $value2) {
                $roleModule = new RoleModule();
                $roleModule->role = $id;
                $roleModule->module = $value['name'];
                $roleModule->hak_akses = $value2;
                $roleModule->save();
---
INSERT INTO `role_module` (`role`, `module`, `hak_akses`) VALUES (8, 1, 2)