models/User.php

SELECT * FROM `user` WHERE `id`=4
---
    public static function findIdentity($id)
    {
        return new static(self::find()->where(['id'=>$id])->one());

SELECT * FROM `user` WHERE `username`='intan elek'
---
    public static function findByUsername($username)
    {
        $result = self::find()->where(['username'=>$username])->one();